Autodesk.Revit.DB.ElementSet
A set that contains element objects.

Autodesk.Revit.DB.ElementSet.Insert(Autodesk.Revit.DB.Element)
System.Int32
Insert the specified element into the set.
item: The element to be inserted into the set.
Returns: Returns whether the element was inserted into the set.

Autodesk.Revit.DB.ElementSet.GetEnumerator
System.Collections.IEnumerator
Retrieve a forward moving iterator to the set.
Returns: Returns a forward moving iterator to the set.

Autodesk.Revit.DB.ElementSet.ReverseIterator
Autodesk.Revit.DB.ElementSetIterator
Retrieve a backward moving iterator to the set.
Returns: Returns a backward moving iterator to the set.

Autodesk.Revit.DB.ElementSet.ForwardIterator
Autodesk.Revit.DB.ElementSetIterator
Retrieve a forward moving iterator to the set.
Returns: Returns a forward moving iterator to the set.

Autodesk.Revit.DB.ElementSet.Erase(Autodesk.Revit.DB.Element)
System.Int32
Removes a specified element from the set.
item: The element to be erased.
Returns: The number of elements that were erased from the set.

Autodesk.Revit.DB.ElementSet.Contains(Autodesk.Revit.DB.Element)
System.Boolean
Tests for the existence of an element within the set.
item: The element to be searched for.
Returns: The Contains method returns True if the element is within the set, otherwise False.

Autodesk.Revit.DB.ElementSet.Clear
void
Removes every item element the set, rendering it empty.

Autodesk.Revit.DB.ElementSet.Size
System.Int32
get
Returns the number of elements that are in the set.

Autodesk.Revit.DB.ElementSet.IsEmpty
System.Boolean
get
Test to see if the set is empty.
Remarks: If the set is empty then True will be returned, otherwise False.